papers/tac-12-integrity.html
---
comments: true
layout: page
title: On the Performance Degradation of Cyber-Physical Systems under Stealthy Integrity Attacks
---
<hr />
<p>
<b>Yilin Mo and Bruno Sinopoli</b>
</p>

<p>
<i>IEEE Transactions on Automatic Control</i>, Accepted
</p>

<p>
Link to the <a href="../../../public/papers/tac-12-integrity.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Ftac-12-integrity.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org279aa6f" class="outline-2">
<h2 id="org279aa6f">Abstract</h2>
<div class="outline-text-2" id="text-org279aa6f">
<p>
This paper analyzes the effect of stealthy integrity attacks on Cyber-Physical Systems, which is modeled as a Stochastic Linear Time-Invariant (LTI) system equipped with a linear filter, a linear feedback controller and a \(\chi^2\) failure detector. An attacker wishes to induce perturbation in the control loop by compromising a subset of the sensors and injecting an exogenous control input, without incurring detection from an anomaly detector. We show how the problem can be modeled, from the attacker's standpoint, as a constrained control problem and that the characterization of the maximum perturbation can be posed as reachable set computation, which we solve using ellipsoidal calculus. 
</p>
</div>
</div>

<div id="outline-container-org4410cc3" class="outline-2">
<h2 id="org4410cc3">Simulation Code</h2>
<div class="outline-text-2" id="text-org4410cc3">
<p>
The code is written in Matlab R2009b (7.9.0.529).
</p>
<ul class="org-ul">
<li><a href="../../../public/code/tac-12-integrity/plotellipsoid.m">plotellipsoid.m</a></li>
<li><a href="../../../public/code/tac-12-integrity/position.m">position.m</a></li>
<li><a href="../../../public/code/tac-12-integrity/velocity.m">velocity.m</a></li>
</ul>
</div>
</div>
